ybharatu/Third_Eye_Not_Blind/NRF52_code/main_micro/main.c
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTC_EVT_TIMEOUT:
        {
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTS_EVT_TIMEOUT:
        {
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
        } break;

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupts.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    ret_code_t err_code;

    switch (pin_no)
    {
        case LEDBUTTON_BUTTON_PIN:
            err_code = ble_lbs_led_status_send(&m_ble_lbs_c, button_action);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            if (err_code == NRF_SUCCESS)
            {
                NRF_LOG_INFO("LBS write LED state %d", button_action);
            }
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}

/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON_PIN, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    ble_lbs_on_db_disc_evt(&m_ble_lbs_c[p_evt->conn_handle], p_evt);
}


/**@brief Database discovery initialization.
 */
static void db_discovery_init(void)
{
    ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
}

//GPIO Pin interrupt handler for the three pins from the raspberry pi
nrfx_gpiote_evt_handler_t drifting_gpio_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t state)
{
    NRF_LOG_INFO("GPIO INTRPT");

    int pin_val = nrf_gpio_pin_read(pin);

    if(pin == DRIFT_LEFT_PIN){
        if(pin_val == 1){
            curr_drift = LEFT;
            draw_right = 0;
            draw_left = 1;
            rect_status = 2;
        }else{
            curr_drift = CENTER;
            draw_right = 0;
            draw_left = 0;
            rect_status = 0;
        }
    }else if(pin == DRIFT_RIGHT_PIN){
        if(pin_val == 1){
            curr_drift = RIGHT;
            draw_right = 0;
            draw_left = 1;
            rect_status = 2;
        }else{
            curr_drift = CENTER;
            draw_right = 0;
            draw_left = 0;
            rect_status = 0;
        }
    }else if(pin == ERROR_PIN){
        if(pin_val == 1){
            drift_error = 1;
        }else{
            drift_error = 0;
        }
    }
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}

static void gpio_init(void)
{
    ret_code_t err_code;

    err_code = nrfx_gpiote_init();
    APP_ERROR_CHECK(err_code);

    nrfx_gpiote_in_config_t in_config = NRFX_GPIOTE_CONFIG_IN_SENSE_TOGGLE(true);
    in_config.pull = NRF_GPIO_PIN_PULLDOWN;

    err_code = nrfx_gpiote_in_init(DRIFT_LEFT_PIN, &in_config, (nrfx_gpiote_evt_handler_t) drifting_gpio_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrfx_gpiote_in_init(DRIFT_RIGHT_PIN, &in_config, (nrfx_gpiote_evt_handler_t) drifting_gpio_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrfx_gpiote_in_init(ERROR_PIN, &in_config, (nrfx_gpiote_evt_handler_t) drifting_gpio_handler);
    APP_ERROR_CHECK(err_code);

    nrf_gpio_cfg_output(LEFT_LED);

    nrfx_gpiote_in_event_enable(DRIFT_LEFT_PIN, true);
    nrfx_gpiote_in_event_enable(DRIFT_RIGHT_PIN, true);
    nrfx_gpiote_in_event_enable(ERROR_PIN, true);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details Handle any pending log operation(s), then sleep until the next event occurs.
 */
static void idle_state_handle(void)
{
    NRF_LOG_FLUSH();
    nrf_pwr_mgmt_run();
}


/**@brief Handles events coming from the LED Button central module.
 */
static void lbs_c_evt_handler(ble_lbs_c_t * p_lbs_c, ble_lbs_c_evt_t * p_lbs_c_evt)
{
    switch (p_lbs_c_evt->evt_type)
    {
        case BLE_LBS_C_EVT_DISCOVERY_COMPLETE:
        {
            ret_code_t err_code;

            err_code = ble_lbs_c_handles_assign(&m_ble_lbs_c,
                                                p_lbs_c_evt->conn_handle,
                                                &p_lbs_c_evt->params.peer_db);
            NRF_LOG_INFO("LED Button service discovered on conn_handle 0x%x.", p_lbs_c_evt->conn_handle);

//            err_code = app_button_enable();
//            APP_ERROR_CHECK(err_code);

            // LED Button service discovered. Enable notification of Button.
            err_code = ble_lbs_c_button_notif_enable(p_lbs_c);
            APP_ERROR_CHECK(err_code);
        } break; // BLE_LBS_C_EVT_DISCOVERY_COMPLETE

        case BLE_LBS_C_EVT_BUTTON_NOTIFICATION:
        {
            draw_text = 1;
            NRF_LOG_INFO("Button state changed on peer to 0x%x.", p_lbs_c_evt->params.button.button_state);
//            if (p_lbs_c_evt->params.button.button_state)
//            {
////                bsp_board_led_on(LEDBUTTON_LED);
//                nrf_gpio_pin_write(LEDBUTTON_LED,0);
//            }
//            else
//            {
////                bsp_board_led_off(LEDBUTTON_LED);
//                nrf_gpio_pin_write(LEDBUTTON_LED,1);
//            }
              /************************************************
              * Actions if received "CLOSE" message from
              * peripheral micro:
              * 1. Change text to "Close"
              * 2. Change LED Status
              ************************************************/
              if (p_lbs_c_evt->params.button.button_state)
              {
                  object_close = 1;
                  text = close;
                  nrf_gpio_pin_write(LEFT_LED,1);
                  NRF_LOG_INFO("Received LED ON!");
              }
              /************************************************
              * Actions if received "FAR" message from
              * peripheral micro:
              * 1. Change text to "Far"
              * 2. Change LED Status
              ************************************************/
              else
              {
                  object_close = 0;
                  text = far;
                  nrf_gpio_pin_write(LEFT_LED,0);
                  NRF_LOG_INFO("Received LED OFF!");
              }
        } break; // BLE_LBS_C_EVT_BUTTON_NOTIFICATION

        default:
            // No implementation needed.
            break;
    }
}

/**@brief LED Button client initialization.
 */
static void lbs_c_init(void)
{
    ret_code_t       err_code;
    ble_lbs_c_init_t lbs_c_init_obj;

