ybharatu/Third_Eye_Not_Blind/NRF52_code/main_micro/main.c
    lbs_c_init_obj.evt_handler = lbs_c_evt_handler;

//    err_code = ble_lbs_c_init(&m_ble_lbs_c, &lbs_c_init_obj);
//    APP_ERROR_CHECK(err_code);
    for (uint32_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        err_code = ble_lbs_c_init(&m_ble_lbs_c[i], &lbs_c_init_obj);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_init(BSP_INIT_LEDS);
//    nrf_gpio_cfg_output(LEDBUTTON_LED);
//    nrf_gpio_cfg_output(CENTRAL_CONNECTED_LED);
//    nrf_gpio_cfg_output(CENTRAL_SCANNING_LED);

//    nrf_gpio_pin_write(CENTRAL_CONNECTED_LED,0);
//    nrf_gpio_pin_write(CENTRAL_SCANNING_LED,1);
}

/**@brief Function for initializing the log.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing the Power manager. */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Scaning events.
 *
 * @param[in]   p_scan_evt   Scanning event.
 */
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
    ret_code_t err_code;

    switch(p_scan_evt->scan_evt_id)
    {
        case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
            err_code = p_scan_evt->params.connecting_err.err_code;
            APP_ERROR_CHECK(err_code);
            break;
        default:
          break;
    }
}

static void scan_init(void)
{
    ret_code_t          err_code;
    nrf_ble_scan_init_t init_scan;

    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = true;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    // Setting filters for scanning.
    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, m_target_periph_name);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

static void screen_clear(void)
{ 
    nrf_gfx_screen_fill(lcd, GRAY);
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

int main(void)
{ 
    bsp_board_init(BSP_INIT_LEDS);


//    Initialize.
    gpio_init();
    log_init();
    //leds_init();
    timers_init();
    //buttons_init();
    pwm_init();

    nrf_gfx_init(lcd);
    power_management_init();

    //BLE init
    ble_stack_init();
    gatt_init();
    db_discovery_init();
    lbs_c_init();
    ble_conn_state_init();
    scan_init();
   
    screen_clear();

    //Initialize the Screen
    nrf_gfx_rect_t wipe_text = NRF_GFX_RECT(5, nrf_gfx_height_get(lcd) - 50, nrf_gfx_width_get(lcd), 40); //Creating the wipe text rectangle
    uint32_t value;

    //Graphics init for the 2 lane lines
    int offset = 100;
    int width = 20;
    int height = 40;

    nrf_gfx_rect_t right_rect_1 = NRF_GFX_RECT(50,offset,height,width);
    nrf_gfx_rect_t right_rect_2 = NRF_GFX_RECT(100,offset,height,width);
    nrf_gfx_rect_t right_rect_3 = NRF_GFX_RECT(150,offset,height,width);

    nrf_gfx_rect_t left_rect_1 = NRF_GFX_RECT(50,320-offset-width,height,width);
    nrf_gfx_rect_t left_rect_2 = NRF_GFX_RECT(100,320-offset-width,height,width);
    nrf_gfx_rect_t left_rect_3 = NRF_GFX_RECT(150,320-offset-width,height,width);


    //Graphics Init for the bluetooth Logo
    int scale = 10;
    int start_x = 30;
    int start_y = 40;
    int thickness = 4;

    nrf_gfx_line_t blue_1 = NRF_GFX_LINE(start_x,start_y,start_x + scale*2,start_y-scale*2,thickness);
    nrf_gfx_line_t blue_2 = NRF_GFX_LINE(start_x + scale*2,start_y - scale*2,start_x + scale*3,start_y - scale*1,thickness);
    nrf_gfx_line_t blue_3 = NRF_GFX_LINE(start_x - scale*1,start_y - scale*1,start_x + scale*3 + thickness,start_y - scale*1,thickness);
    nrf_gfx_line_t blue_4 = NRF_GFX_LINE(start_x - scale*1,start_y - scale*1,start_x + scale*0,start_y - scale*2,thickness);
    nrf_gfx_line_t blue_5 = NRF_GFX_LINE(start_x + scale*0,start_y - scale*2,start_x + scale*2,start_y - scale*0,thickness);

    //Graphics for the Red Circle over the logo
    int circ_thick = 5;

    nrf_gfx_line_t line_red = NRF_GFX_LINE(start_x,start_y - scale*3,start_x + scale*2,start_y + scale,circ_thick);
    nrf_gfx_circle_t my_circle = NRF_GFX_CIRCLE((start_x + (start_x + scale*2)) / 2, (start_y - scale*3 + (start_y + scale)) / 2, scale*3);


    // Start execution.
    NRF_LOG_INFO("Main Code started.");
    scan_start();
    bsp_board_led_on(CENTRAL_SCANNING_LED);

    nrf_gfx_line_draw(lcd, &blue_1,BLUE);
    nrf_gfx_line_draw(lcd, &blue_2,BLUE);
    nrf_gfx_line_draw(lcd, &blue_3,BLUE);
    nrf_gfx_line_draw(lcd, &blue_4,BLUE);
    nrf_gfx_line_draw(lcd, &blue_5,BLUE);

    nrf_gfx_rect_draw(lcd, &left_rect_1,2,BLACK,false);
    nrf_gfx_rect_draw(lcd, &left_rect_2,2,BLACK,false);
    nrf_gfx_rect_draw(lcd, &left_rect_3,2,BLACK,false);

