ybharatu/Third_Eye_Not_Blind/NRF52_code/main_micro/main.c
    nrf_gfx_rect_draw(lcd, &right_rect_1,2,BLACK,false);
    nrf_gfx_rect_draw(lcd, &right_rect_2,2,BLACK,false);
    nrf_gfx_rect_draw(lcd, &right_rect_3,2,BLACK,false);
    
    while (true)
    {

      if (ble_conn_state_central_conn_count() > 0 && draw_ble == 1)
        {
            draw_ble = 0;
            nrf_gfx_line_draw(lcd, &line_red, GRAY);
            nrf_gfx_circle_draw(lcd, &my_circle, GRAY, true);
            nrf_gfx_line_draw(lcd, &blue_1,BLUE);
            nrf_gfx_line_draw(lcd, &blue_2,BLUE);
            nrf_gfx_line_draw(lcd, &blue_3,BLUE);
            nrf_gfx_line_draw(lcd, &blue_4,BLUE);
            nrf_gfx_line_draw(lcd, &blue_5,BLUE);
        }
      else if(draw_ble == 1)
        {
            draw_ble = 0;
            nrf_gfx_line_draw(lcd, &line_red, RED);
            nrf_gfx_circle_draw(lcd, &my_circle, RED, false);
        }

      if(object_close){
        /* Set the duty cycle - keep trying until PWM is ready... */
        NRF_LOG_INFO("OBJECT IS CLOSE. SHOULD MAKE NOISE!");
        ready_flag = false;
        while (app_pwm_channel_duty_set(&PWM1, 0, 50) == NRF_ERROR_BUSY);
        //nrf_delay_ms(25);      
      }
      else{
          app_pwm_channel_duty_set(&PWM1, 0, 0);
      }

      if(draw_text){
            draw_text = 0;
            //nrf_gfx_rotation_set(lcd, NRF_LCD_ROTATE_270 );
            nrf_gfx_rect_draw(lcd,&wipe_text,10,GRAY,true);
            nrf_gfx_point_t text_start = NRF_GFX_POINT(5, nrf_gfx_height_get(lcd) - 50);
            APP_ERROR_CHECK(nrf_gfx_print(lcd, &text_start, 0, text, p_font, true));
            //nrf_gfx_rotation_set(lcd, NRF_LCD_ROTATE_90 );
      }
      if(draw_right){
          draw_right = 0;
          nrf_gfx_rect_draw(lcd, &right_rect_1,2,RED,true);
          nrf_gfx_rect_draw(lcd, &right_rect_2,2,RED,true);
          nrf_gfx_rect_draw(lcd, &right_rect_3,2,RED,true);
      }
      else if(draw_left){
          draw_left = 0;
          nrf_gfx_rect_draw(lcd, &left_rect_1,2,RED,true);
          nrf_gfx_rect_draw(lcd, &left_rect_2,2,RED,true);
          nrf_gfx_rect_draw(lcd, &left_rect_3,2,RED,true);
      }
      else if(rect_status == 0){
          rect_status = 1;
          nrf_gfx_rect_draw(lcd, &left_rect_1,2,GRAY,true);
          nrf_gfx_rect_draw(lcd, &left_rect_2,2,GRAY,true);
          nrf_gfx_rect_draw(lcd, &left_rect_3,2,GRAY,true);

          nrf_gfx_rect_draw(lcd, &right_rect_1,2,GRAY,true);
          nrf_gfx_rect_draw(lcd, &right_rect_2,2,GRAY,true);
          nrf_gfx_rect_draw(lcd, &right_rect_3,2,GRAY,true);

          nrf_gfx_rect_draw(lcd, &left_rect_1,2,BLACK,false);
          nrf_gfx_rect_draw(lcd, &left_rect_2,2,BLACK,false);
          nrf_gfx_rect_draw(lcd, &left_rect_3,2,BLACK,false);
                                                
          nrf_gfx_rect_draw(lcd, &right_rect_1,2,BLACK,false);
          nrf_gfx_rect_draw(lcd, &right_rect_2,2,BLACK,false);
          nrf_gfx_rect_draw(lcd, &right_rect_3,2,BLACK,false);
      }
      idle_state_handle();
    }

}
